depot/app/controllers/store_controller.rb

INSERT INTO "line_items" ("total_price", "created_at", "updated_at", "product_id", "order_id", "quantity") VALUES(0.01, '2012-03-23 18:11:21', '2012-03-23 18:11:21', 7, 1, 1)
INSERT INTO "orders" ("address", "name", "pay_type", "created_at", "updated_at", "email") VALUES('Bluemill drives 99999', 'Jon', 'check', '2012-03-23 18:11:21', '2012-03-23 18:11:21', 'itsanemail@domain.com')
---
  def save_order
	@cart = find_cart
	@order = Order.new(params[:order])
	@order.add_line_items_from_cart(@cart)
	if @order.save