depot/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "hashed_password", "created_at", "updated_at", "salt") VALUES('What', '3a5f634220590a40d2660ed4c5be5eb68cb364b8', '2012-03-30 16:21:07', '2012-03-30 16:21:07', '700432636082000.380711940721604')

  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
DELETE FROM "users" WHERE "id" = 1